//------------------------------------------------------------------------
// NAME: Petar Damyanov
// CLASS: XIb
// NUMBER: 21
// PROBLEM: #1
// FILE NAME: voidswap.c
// FILE PURPOSE: Задачата трябва да размени стойностите на две числа.
// 
//
// ...
//------------------------------------------------------------------------

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
//------------------------------------------------------------------------
// FUNCTION: swap
// Функцията разменя стойностите на две числа.
// PARAMETERS:
// void* c - Първо заделям памет, колкото е голям size, тоест сайза на а и б. След това, благодарение на memcpy копирам size
// символа от паметта на а в c.
// Аналогично следват 27 и 28 ред, а след това трия заделената памет от променливата c. 
// 
//------------------------------------------------------------------------
void swap(void *a, void *b, size_t size){
    void* c = malloc(size);
    memcpy(c, a, size);
    memcpy(a, b, size);
    memcpy(b, c, size);
    free(c);
}

int main()
{
    int a = 10;
    int b = 5;
    swap(&a, &b, 4);
    printf("%d %d", a, b);
    return 0;
}